; domain
(define (domain blocksworld)
    (:requirements :strips :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty ?x - robot)
        (handfull ?x - robot)
        (holding ?x - block)
    )
    (:action pick-up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put-down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld2)
    (:domain blocksworld)
    (:objects
        yellow_block - block
        green_block - block
        pink_block - block
        red_block - block
        purple_block - block
        robot - robot
    )
    (:init
        (ontable yellow_block)
        (ontable green_block)
        (ontable pink_block)
        (ontable red_block)
        (on purple_block red_block)
        (handempty robot)
        (clear yellow_block)
        (clear green_block)
        (clear pink_block)
        (clear purple_block)
    )
    (:goal (and 
        (on yellow_block green_block)
        (on green_block pink_block)
        (on red_block purple_block)
    ))
)

; plan
1. (pick-up green_block robot)
   deleted: (ontable green_block) (clear green_block) (handempty robot)
   added: (handfull robot) (holding green_block)
   goals met: 0 of 3
2. (stack green_block pink_block robot)
   deleted: (holding green_block) (clear pink_block) (handfull robot)
   added: (clear green_block) (handempty robot) (on green_block pink_block)
   goals met: 1 of 3
3. (pick-up yellow_block robot)
   deleted: (ontable yellow_block) (clear yellow_block) (handempty robot)
   added: (handfull robot) (holding yellow_block)
   goals met: 1 of 3
4. (stack yellow_block green_block robot)
   deleted: (holding yellow_block) (clear green_block) (handfull robot)
   added: (clear yellow_block) (handempty robot) (on yellow_block green_block)
   goals met: 2 of 3
5. (unstack purple_block red_block robot)
   deleted: (clear purple_block) (handempty robot) (on purple_block red_block)
   added: (holding purple_block) (clear red_block) (handfull robot)
   goals met: 2 of 3
6. (put-down purple_block robot)
   deleted: (holding purple_block) (handfull robot)
   added: (clear purple_block) (handempty robot) (ontable purple_block)
   goals met: 2 of 3
7. (pick-up red_block robot)
   deleted: (ontable red_block) (clear red_block) (handempty robot)
   added: (handfull robot) (holding red_block)
   goals met: 2 of 3
8. (stack red_block purple_block robot)
   deleted: (holding red_block) (clear purple_block) (handfull robot)
   added: (clear red_block) (handempty robot) (on red_block purple_block)
   goals met: 3 of 3
